"use client";
import LeaderCard from "./LeaderCard";
import PaginationActions from "../common/PaginationActions";
import LeadersInfo from "./LeadersInfo";
import { useEffect, useState } from "react";
import { useSwiper } from "swiper/react";
const AllLeaders = [
  {
    img: "/images/leadership/leaders/1.jpg",
    name: "عبدالعزيز ماجد",
    text: "رئيس مجلس الإدارة",
    innerData: ` <p>
              لوريم ايبسوم دولار سيت أميت كونسيك تيتور أدايبا يسكينج أليايت,سيت
              دو أيوسم ود تيمبورأنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا .
              لوريم ايبسوم دولار سيت أميت كونسيك تيتور أدايبا يسكينج أليايت,سيت
              دو أيو تيمبورأنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا .
            </p>
            <p>
              لوريم ايبسوم دولار سيت أميت كونسيك تيتور أدايبا يسكينج أليايت,سيت
              دو أيوسم ود تيمبورأنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا .
              لوريم ايبسواتتم دولار سيت أميت كونسيك تيتور أدايبا يسكينج
              أليايت,سيت دو أيوسم ود تيمبورأنكايديديونتيوت لابوري ات دولار ماجنا
              أليكيوا . لوريم ايبسوم دولار سيت أمييبا يسكينج أليايت,سيت دو أيوسم
              ود تيمبورأن سب كايديديونتيوت لاريبيلربوري ات دولار ماجنا أليكيوا .
            </p>`,
  },
  {
    img: "/images/leadership/leaders/2.jpg",
    name: "عبدالعزيز ماجد",
    text: "رئيس مجلس الإدارة",
    innerData: ` <p>
              لوريم ايبسوم دولار سيت أميت كونسيك تيتور أدايبا يسكينج أليايت,سيت
              دو أيوسم ود تيمبورأنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا .
              لوريم ايبسوم دولار سيت أميت كونسيك تيتور أدايبا يسكينج أليايت,سيت
              دو أيو تيمبورأنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا .
            </p>
            <p>
              لوريم ايبسوم دولار سيت أميت كونسيك تيتور أدايبا يسكينج أليايت,سيت
              دو أيوسم ود تيمبورأنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا .
              لوريم ايبسواتتم دولار سيت أميت كونسيك تيتور أدايبا يسكينج
              أليايت,سيت دو أيوسم ود تيمبورأنكايديديونتيوت لابوري ات دولار ماجنا
              أليكيوا . لوريم ايبسوم دولار سيت أمييبا يسكينج أليايت,سيت دو أيوسم
              ود تيمبورأن سب كايديديونتيوت لاريبيلربوري ات دولار ماجنا أليكيوا .
            </p>`,
  },

  {
    img: "/images/leadership/leaders/3.jpg",
    name: "ايمن حافظ",
    text: "عضو مستقل غير تنفيذي",
    innerData: ` <p>
              لوريم ايبسوم دولار سيت أميت كونسيك تيتور أدايبا يسكينج أليايت,سيت
              دو أيوسم ود تيمبورأنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا .
              لوريم ايبسوم دولار سيت أميت كونسيك تيتور أدايبا يسكينج أليايت,سيت
              دو أيو تيمبورأنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا .
            </p>
            <p>
              لوريم ايبسوم دولار سيت أميت كونسيك تيتور أدايبا يسكينج أليايت,سيت
              دو أيوسم ود تيمبورأنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا .
              لوريم ايبسواتتم دولار سيت أميت كونسيك تيتور أدايبا يسكينج
              أليايت,سيت دو أيوسم ود تيمبورأنكايديديونتيوت لابوري ات دولار ماجنا
              أليكيوا . لوريم ايبسوم دولار سيت أمييبا يسكينج أليايت,سيت دو أيوسم
              ود تيمبورأن سب كايديديونتيوت لاريبيلربوري ات دولار ماجنا أليكيوا .
            </p>`,
  },
  {
    img: "/images/leadership/leaders/4.jpg",
    name: "سعاد محمد",
    text: "عضو مستقل غير تنفيذي",
    innerData: ` <p>
              لوريم ايبسوم دولار سيت أميت كونسيك تيتور أدايبا يسكينج أليايت,سيت
              دو أيوسم ود تيمبورأنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا .
              لوريم ايبسوم دولار سيت أميت كونسيك تيتور أدايبا يسكينج أليايت,سيت
              دو أيو تيمبورأنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا .
            </p>
            <p>
              لوريم ايبسوم دولار سيت أميت كونسيك تيتور أدايبا يسكينج أليايت,سيت
              دو أيوسم ود تيمبورأنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا .
              لوريم ايبسواتتم دولار سيت أميت كونسيك تيتور أدايبا يسكينج
              أليايت,سيت دو أيوسم ود تيمبورأنكايديديونتيوت لابوري ات دولار ماجنا
              أليكيوا . لوريم ايبسوم دولار سيت أمييبا يسكينج أليايت,سيت دو أيوسم
              ود تيمبورأن سب كايديديونتيوت لاريبيلربوري ات دولار ماجنا أليكيوا .
            </p>`,
  },
  {
    img: "/images/leadership/leaders/3.jpg",
    name: "ايمن حافظ",
    text: "عضو مستقل غير تنفيذي",
    innerData: ` <p>
              لوريم ايبسوم دولار سيت أميت كونسيك تيتور أدايبا يسكينج أليايت,سيت
              دو أيوسم ود تيمبورأنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا .
              لوريم ايبسوم دولار سيت أميت كونسيك تيتور أدايبا يسكينج أليايت,سيت
              دو أيو تيمبورأنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا .
            </p>
            <p>
              لوريم ايبسوم دولار سيت أميت كونسيك تيتور أدايبا يسكينج أليايت,سيت
              دو أيوسم ود تيمبورأنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا .
              لوريم ايبسواتتم دولار سيت أميت كونسيك تيتور أدايبا يسكينج
              أليايت,سيت دو أيوسم ود تيمبورأنكايديديونتيوت لابوري ات دولار ماجنا
              أليكيوا . لوريم ايبسوم دولار سيت أمييبا يسكينج أليايت,سيت دو أيوسم
              ود تيمبورأن سب كايديديونتيوت لاريبيلربوري ات دولار ماجنا أليكيوا .
            </p>`,
  },
  {
    img: "/images/leadership/leaders/1.jpg",
    name: "عبدالعزيز ماجد",
    text: "رئيس مجلس الإدارة",
    innerData: ` <p>
              لوريم ايبسوم دولار سيت أميت كونسيك تيتور أدايبا يسكينج أليايت,سيت
              دو أيوسم ود تيمبورأنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا .
              لوريم ايبسوم دولار سيت أميت كونسيك تيتور أدايبا يسكينج أليايت,سيت
              دو أيو تيمبورأنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا .
            </p>
            <p>
              لوريم ايبسوم دولار سيت أميت كونسيك تيتور أدايبا يسكينج أليايت,سيت
              دو أيوسم ود تيمبورأنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا .
              لوريم ايبسواتتم دولار سيت أميت كونسيك تيتور أدايبا يسكينج
              أليايت,سيت دو أيوسم ود تيمبورأنكايديديونتيوت لابوري ات دولار ماجنا
              أليكيوا . لوريم ايبسوم دولار سيت أمييبا يسكينج أليايت,سيت دو أيوسم
              ود تيمبورأن سب كايديديونتيوت لاريبيلربوري ات دولار ماجنا أليكيوا .
            </p>`,
  },
  {
    img: "/images/leadership/leaders/5.jpg",
    name: "زينه مؤمن",
    text: "عضو غير تنفيذي",
    innerData: ` <p>
              لوريم ايبسوم دولار سيت أميت كونسيك تيتور أدايبا يسكينج أليايت,سيت
              دو أيوسم ود تيمبورأنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا .
              لوريم ايبسوم دولار سيت أميت كونسيك تيتور أدايبا يسكينج أليايت,سيت
              دو أيو تيمبورأنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا .
            </p>
            <p>
              لوريم ايبسوم دولار سيت أميت كونسيك تيتور أدايبا يسكينج أليايت,سيت
              دو أيوسم ود تيمبورأنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا .
              لوريم ايبسواتتم دولار سيت أميت كونسيك تيتور أدايبا يسكينج
              أليايت,سيت دو أيوسم ود تيمبورأنكايديديونتيوت لابوري ات دولار ماجنا
              أليكيوا . لوريم ايبسوم دولار سيت أمييبا يسكينج أليايت,سيت دو أيوسم
              ود تيمبورأن سب كايديديونتيوت لاريبيلربوري ات دولار ماجنا أليكيوا .
            </p>`,
  },
  {
    img: "/images/leadership/leaders/2.jpg",
    name: "ماهر جميل",
    text: "عضو غير تنفيذي",
    innerData: ` <p>
              لوريم ايبسوم دولار سيت أميت كونسيك تيتور أدايبا يسكينج أليايت,سيت
              دو أيوسم ود تيمبورأنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا .
              لوريم ايبسوم دولار سيت أميت كونسيك تيتور أدايبا يسكينج أليايت,سيت
              دو أيو تيمبورأنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا .
            </p>
            <p>
              لوريم ايبسوم دولار سيت أميت كونسيك تيتور أدايبا يسكينج أليايت,سيت
              دو أيوسم ود تيمبورأنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا .
              لوريم ايبسواتتم دولار سيت أميت كونسيك تيتور أدايبا يسكينج
              أليايت,سيت دو أيوسم ود تيمبورأنكايديديونتيوت لابوري ات دولار ماجنا
              أليكيوا . لوريم ايبسوم دولار سيت أمييبا يسكينج أليايت,سيت دو أيوسم
              ود تيمبورأن سب كايديديونتيوت لاريبيلربوري ات دولار ماجنا أليكيوا .
            </p>`,
  },
];
const Leaders = ({ en, title, teamMembers }) => {
  const [isOpen, setIsOpen] = useState(false);
  const [swiperInstance, setSwiperInstance] = useState(null);
  const swiper = useSwiper();
  const handleClick = (index) => {
    if (swiperInstance) {
      swiperInstance.slideTo(index);
    }
    // setCurrentLeader(index);
    setIsOpen(true);
  };
  useEffect(() => {}, [swiperInstance]);
  return (
    <>
      <section>
        <div className="myContainer md:py-[9.375vw] py-[80px]">
          <div className="md:w-[45.3125vw] mx-[auto] flex flex-col items-center text-center  md:gap-y-[0.9375vw] gap-y-[14px]">
            <h2 data-aos="fade-up" className="heading2 text-[#244A54]">
              {title}
            </h2>
            {/* <p
              data-aos="fade-down"
              className="para24 font-[400] text-[#4A4A4A]"
            >
              لوريم ايبسوم دولار سيت أميت كونسيك تيتور أدايبا يسكينج أليايت,سيت
              دو أيوسم ود تيمبورأنكايديديونتيوت لابوري ات دولار ماجنا أليكيوا .
            </p> */}
          </div>
          <div className="gap-[40px] flex md:gap-x-[7.70833333333vw] pt-[40px] md:pt-[3.75vw] md:gap-y-[4.16666666667vw] flex-wrap ">
            {teamMembers?.map((member, index) => (
              <LeaderCard
                handleClick={handleClick}
                key={index}
                member={member}
                index={index}
              />
            ))}
          </div>
          {/* <PaginationActions /> */}
        </div>
      </section>
      <LeadersInfo
        setSwiperInstance={setSwiperInstance}
        leaders={teamMembers}
        isOpen={isOpen}
        setIsOpen={setIsOpen}
        en={en}
      />
    </>
  );
};

export default Leaders;
